perf/results/single-node/spike/cfg-spike-async2.yaml
config:
  environments:
    async2:
      target: 'http://localhost:5555/node/async'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 20   # seconds
      arrivalRate: 1
      rampTo: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Increase 
      duration: 10
      arrivalRate: 400
    - name: Increase 
      duration: 10
      arrivalRate: 500
    - name: Increase 
      duration: 10
      arrivalRate: 600
    - name: Reduce
      duration: 10
      arrivalRate: 500
    - name: Reduce
      duration: 10
      arrivalRate: 400
    - name: Reduce
      duration: 10
      arrivalRate: 300
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 60
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'