perf/results/single-node/spike/cfg-spike-sync.yaml
config:
  environments:
    sync:
      target: 'http://localhost:5555/node/sync'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Slow Ramp
      duration: 10    # seconds
      arrivalRate: 1
      rampTo: 3
    - name: Plain Line
      duration: 45
      arrivalRate: 3
    - name: Soft Spike
      duration: 5     # seconds
      arrivalRate: 3
      rampTo: 7
    - name: Soft Spike Plateau
      duration: 25
      arrivalRate: 7
    - name: Cooldown 1
      duration: 100
      arrivalRate: 3
    - name: Strong Spike
      duration: 5     # seconds
      arrivalRate: 3
      rampTo: 14
    - name: Strong Spike Plateau
      duration: 25
      arrivalRate: 14
    - name: Cooldown 2
      duration: 140
      arrivalRate: 3
    - name: Strong Long Spike
      duration: 5     # seconds
      arrivalRate: 3
      rampTo: 14
    - name: Strong Long Spike Plateau
      duration: 60
      arrivalRate: 14
    - name: Cooldown 3
      duration: 100
      arrivalRate: 3
    - name: Cooldown 4
      duration: 60
      arrivalRate: 2
    - name: Reset Line
      duration: 60
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'